Ran Plan for dir: `ec2` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.private_es_ec2_instances[0] will be destroyed
  # (because index [0] is out of range for count)
- resource "aws_instance" "private_es_ec2_instances" {
      - ami                                  = "ami-08e4b984abde34a4f" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-0c1ef9a55bf60f4fe" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "ap-southeast-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0c1ef9a55bf60f4fe" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "elasticsearch" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0c3316449759b3606" -> null
      - private_dns                          = "ip-192-168-5-67.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "192.168.5.67" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-000647f54b5fd59a6" -> null
      - tags                                 = {
          - "Name" = "es-4"
        } -> null
      - tags_all                             = {
          - "Name" = "es-4"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "2aa22c0bab0614e787ad02fa319987cbd3c0da3f" -> null
      - vpc_security_group_ids               = [
          - "sg-0a17ee464b4108c42",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-079f4545585971b10" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.private_es_ec2_instances[1] will be destroyed
  # (because index [1] is out of range for count)
- resource "aws_instance" "private_es_ec2_instances" {
      - ami                                  = "ami-08e4b984abde34a4f" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-048583fb81ced10f4" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "ap-southeast-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-048583fb81ced10f4" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "elasticsearch" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0a7f8de1c9237c388" -> null
      - private_dns                          = "ip-192-168-4-172.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "192.168.4.172" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0480eb3937b1c0eb9" -> null
      - tags                                 = {
          - "Name" = "es-5"
        } -> null
      - tags_all                             = {
          - "Name" = "es-5"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "2aa22c0bab0614e787ad02fa319987cbd3c0da3f" -> null
      - vpc_security_group_ids               = [
          - "sg-0a17ee464b4108c42",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0576340808a556aab" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.private_es_ec2_instances[2] will be destroyed
  # (because index [2] is out of range for count)
- resource "aws_instance" "private_es_ec2_instances" {
      - ami                                  = "ami-08e4b984abde34a4f" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-0bcec7c1c1fbf1654" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "ap-southeast-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0bcec7c1c1fbf1654" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "elasticsearch" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-096fe02cd429e5c38" -> null
      - private_dns                          = "ip-192-168-3-181.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "192.168.3.181" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-07dd20dc41b75c447" -> null
      - tags                                 = {
          - "Name" = "es-6"
        } -> null
      - tags_all                             = {
          - "Name" = "es-6"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "2aa22c0bab0614e787ad02fa319987cbd3c0da3f" -> null
      - vpc_security_group_ids               = [
          - "sg-0a17ee464b4108c42",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e6e047a3659c2c53" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.public_ec2_instances[0] must be replaced
-/+ resource "aws_instance" "public_ec2_instances" {
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-012eb10ead5653a61" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-012eb10ead5653a61" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-02f0e3eeed6692e83" -> (known after apply)
      ~ private_dns                          = "ip-192-168-2-171.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "192.168.2.171" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "47.128.79.232" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "ansible-host"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "e280e6f119a2de81c610384038466463ff40a660" -> "d1fe113b5dd52262caa8fe1c1ffd162804d8db81" # forces replacement
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-04d5aab2cef2ac05e" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.public_es_ec2_instances[0] will be destroyed
  # (because index [0] is out of range for count)
- resource "aws_instance" "public_es_ec2_instances" {
      - ami                                  = "ami-08e4b984abde34a4f" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-0d4d2811f84a4ef96" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-southeast-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0d4d2811f84a4ef96" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "elasticsearch" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0684de28df2b2808a" -> null
      - private_dns                          = "ip-192-168-2-206.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "192.168.2.206" -> null
      - public_ip                            = "18.141.213.46" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-031f70bafa6c2e4eb" -> null
      - tags                                 = {
          - "Name" = "ansible-host"
        } -> null
      - tags_all                             = {
          - "Name" = "ansible-host"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "c0cdd40ed557f061708d49838d19c62ccfea3f55" -> null
      - vpc_security_group_ids               = [
          - "sg-02d1d2784a8f1212e",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0401955e2559c01d6" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.public_es_ec2_instances[1] will be destroyed
  # (because index [1] is out of range for count)
- resource "aws_instance" "public_es_ec2_instances" {
      - ami                                  = "ami-08e4b984abde34a4f" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-0ccc9f8b76752b56d" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-southeast-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0ccc9f8b76752b56d" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "elasticsearch" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-026fe279bdaf5784d" -> null
      - private_dns                          = "ip-192-168-0-25.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "192.168.0.25" -> null
      - public_ip                            = "54.179.141.221" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0dfbdd4090e8ab3e4" -> null
      - tags                                 = {
          - "Name" = "es-1"
        } -> null
      - tags_all                             = {
          - "Name" = "es-1"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "2aa22c0bab0614e787ad02fa319987cbd3c0da3f" -> null
      - vpc_security_group_ids               = [
          - "sg-02d1d2784a8f1212e",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-044dcfefe57bfe3ed" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.public_es_ec2_instances[2] will be destroyed
  # (because index [2] is out of range for count)
- resource "aws_instance" "public_es_ec2_instances" {
      - ami                                  = "ami-08e4b984abde34a4f" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-0cc513bf4a474579a" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-southeast-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0cc513bf4a474579a" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "elasticsearch" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-047ca8cfeef99609e" -> null
      - private_dns                          = "ip-192-168-1-50.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "192.168.1.50" -> null
      - public_ip                            = "18.136.198.204" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0f9ffe2b308d35846" -> null
      - tags                                 = {
          - "Name" = "es-2"
        } -> null
      - tags_all                             = {
          - "Name" = "es-2"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "2aa22c0bab0614e787ad02fa319987cbd3c0da3f" -> null
      - vpc_security_group_ids               = [
          - "sg-02d1d2784a8f1212e",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0dc7f75ad63e98704" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 7 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://a3235ad69b8a:4141/lock?id=tampubolon%252Felasticsearch-lab%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d ec2`
</details>
Plan: 1 to add, 0 to change, 7 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`